Table of Contents
 Struct LoadImpulse
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
LoadImpulse
public struct LoadImpulse
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.GetType()
 object.ReferenceEquals(object, object)
Properties
 X
Load in X direction
public double X { get; set; }
Property Value
double
 Y
Load in Y direction
public double Y { get; set; }
Property Value
double
 Z
Load in Z direction
public double Z { get; set; }
Property Value
double
 Edit this page